elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
#include <Arduino.h>
#include <Adafruit_NeoPixel.h>
#include <Preferences.h>
#include <esp_ota_ops.h>
#include <esp_sleep.h>
#include <esp_system.h>

#include "default_config.h"
#include "motor_runtime_config.h"
#include "storage_backend.h"

namespace {
void waitForSerialConsole(unsigned long timeoutMs = 1500) {
#if defined(ARDUINO_USB_CDC_ON_BOOT) && ARDUINO_USB_CDC_ON_BOOT
    const unsigned long startedAt = millis();
    while (!Serial && (millis() - startedAt) < timeoutMs) {
        delay(10);
    }
#else
    (void)timeoutMs;
#endif
}

void scheduleReboot(uint32_t delayMs);

uint8_t activeStatusLedPin = DefaultConfig::STATUS_LED_PIN;
bool statusLedInitialized = false;

constexpr uint8_t kStatusLedBrightness = 24;
constexpr unsigned long kApStatusLedBlinkIntervalMs = 1000UL;

#if APP_STATUS_LED_IS_NEOPIXEL
Adafruit_NeoPixel statusLedPixel(1, DefaultConfig::STATUS_LED_PIN, NEO_GRB + NEO_KHZ800);

void initializeStatusLed() {
    statusLedPixel.setPin(activeStatusLedPin);
    statusLedPixel.begin();
    statusLedPixel.clear();
    statusLedPixel.show();
    statusLedInitialized = true;
}

void writeStatusLedColor(uint8_t red, uint8_t green, uint8_t blue) {
    if (!statusLedInitialized) {
        return;
    }
    statusLedPixel.setPixelColor(0, statusLedPixel.Color(red, green, blue));
    statusLedPixel.show();
}

void writeStatusLed(bool on) {
    writeStatusLedColor(0, on ? kStatusLedBrightness : 0, 0);
}

#else
void initializeStatusLed() {
    pinMode(activeStatusLedPin, OUTPUT);
    digitalWrite(activeStatusLedPin, LOW);
    statusLedInitialized = true;
}

void writeStatusLed(bool on) {
    if (!statusLedInitialized) {
        return;
    }
    digitalWrite(activeStatusLedPin, on ? HIGH : LOW);
}

void writeStatusLedColor(uint8_t red, uint8_t green, uint8_t blue) {
    writeStatusLed(red != 0 || green != 0 || blue != 0);
}

#endif

void applyStatusLedPin(uint8_t pin) {
    if (statusLedInitialized && pin == activeStatusLedPin) {
        return;
    }

    writeStatusLed(false);
#if !APP_STATUS_LED_IS_NEOPIXEL
    if (statusLedInitialized) {
        pinMode(activeStatusLedPin, INPUT);
    }
#endif
    activeStatusLedPin = pin;
    initializeStatusLed();
}

bool apStatusLedBluePhase(unsigned long now) {
    return ((now / kApStatusLedBlinkIntervalMs) % 2UL) != 0;
}

void updateStatusLedForNetwork(bool wifiConnected, bool apMode, unsigned long now = millis()) {
    if (wifiConnected) {
        writeStatusLedColor(0, 0, kStatusLedBrightness);
        return;
    }

    if (apMode) {
        writeStatusLedColor(0, 0, apStatusLedBluePhase(now) ? kStatusLedBrightness : 0);
        return;
    }

    writeStatusLed(((now / 300UL) % 2) != 0);
}

}

#ifdef SAFE_BOOT_DIAGNOSTIC
#include "version.h"

namespace {
const char* resetReasonToString(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_UNKNOWN:
            return "unknown";
        case ESP_RST_POWERON:
            return "poweron";
        case ESP_RST_EXT:
            return "external";
        case ESP_RST_SW:
            return "software";
        case ESP_RST_PANIC:
            return "panic";
        case ESP_RST_INT_WDT:
            return "interrupt watchdog";
        case ESP_RST_TASK_WDT:
            return "task watchdog";
        case ESP_RST_WDT:
            return "other watchdog";
        case ESP_RST_DEEPSLEEP:
            return "deepsleep";
        case ESP_RST_BROWNOUT:
            return "brownout";
        case ESP_RST_SDIO:
            return "sdio";
        default:
            return "unhandled";
    }
}

unsigned long lastHeartbeatAt = 0;
}

void setup() {
    Serial.begin(115200);
    waitForSerialConsole();
    delay(300);
    initializeStatusLed();
    writeStatusLed(false);

    Serial.printf("\n[safe-boot] app=%s version=%s built=%s\n", APP_NAME, APP_VERSION, APP_BUILD_DATE);
    Serial.printf("[safe-boot] reset reason=%s (%d)\n", resetReasonToString(esp_reset_reason()), static_cast<int>(esp_reset_reason()));
    Serial.printf("[safe-boot] free heap=%u\n", ESP.getFreeHeap());
    Serial.println("[safe-boot] minimal firmware is running");
    Serial.flush();
}

void loop() {
    static bool heartbeatLedOn = false;
    const unsigned long now = millis();
    if (now - lastHeartbeatAt >= 1000UL) {
        lastHeartbeatAt = now;
        heartbeatLedOn = !heartbeatLedOn;
        writeStatusLed(heartbeatLedOn);
        Serial.printf("[safe-boot] uptime=%lu free_heap=%u\n", now, ESP.getFreeHeap());
        Serial.flush();
    }
    delay(10);
}

#else
#include "app_state.h"
#include "battery_monitor.h"
#include "display_manager.h"
#include "mqtt_manager.h"
#include "motor_control.h"
#include "ota_manager.h"
#include "playback_text.h"
#include "psram_allocator.h"
#include "settings_manager.h"
#include "sound_effects.h"
#include "system_metrics.h"
#include "version.h"
#include "web_server.h"
#include "wifi_manager.h"

#ifdef APP_DISABLE_AUDIO
class AudioPlayerStub {
  public:
    void begin(uint8_t, uint8_t, uint8_t, uint8_t initialVolumePercent, AppState& appState) {
        appState_ = &appState;
        volume_ = initialVolumePercent;
        state_ = "idle";
        type_ = "idle";
        title_ = "Audio disabled";
        url_ = "";
        source_ = "disabled";
        publish();
    }

    void loop() {}

    bool play(const String&, const String&, const String&, const String&) {
        return false;
    }

    bool playStorageFile(StorageTarget, const String&, const String&, const String&, const String&) {
        return false;
    }

    void stop() {
    state_ = "idle";
    type_ = "idle";
    title_ = "Audio disabled";
    url_ = "";
    source_ = "disabled";
    publish();
    }

    void setVolumePercent(uint8_t volumePercent) {
        volume_ = volumePercent;
        publish();
    }

    uint8_t volumePercent() const { return volume_; }
    String currentState() const { return state_; }

    private:
    void publish() {
        if (appState_ != nullptr) {
            appState_->setPlayback(state_, type_, title_, url_, source_, volume_);
        }
    }

    AppState* appState_ = nullptr;
        uint8_t volume_ = DefaultConfig::DEFAULT_VOLUME_PERCENT;
    String state_ = "idle";
    String type_ = "idle";
    String title_ = "Audio disabled";
    String url_;
    String source_ = "disabled";
};

using AudioPlayerType = AudioPlayerStub;
#else
#include "audio_player.h"
using AudioPlayerType = AudioPlayer;
#endif

namespace {
AppState* appState = nullptr;
SettingsManager* settingsManager = nullptr;
SettingsBundle* settings = nullptr;
WiFiManager* wifiManager = nullptr;
BatteryMonitor* batteryMonitor = nullptr;
DisplayManager* displayManager = nullptr;
AudioPlayerType* audioPlayer = nullptr;
OtaManager* otaManager = nullptr;
MqttManager* mqttManager = nullptr;
WebServerManager* webServer = nullptr;
SoundEffectsManager* soundEffects = nullptr;

struct DeferredActions {
    bool settingsApplyPending = false;
    SettingsBundle pendingSettings;
    bool mqttConnectionChangePending = false;
    bool mqttConnectRequested = false;
    bool playPending = false;
    bool playAddToHistory = true;
    bool playFromStorage = false;
    StorageTarget playStorageTarget = StorageTarget::Flash;
    bool stopPending = false;
    bool volumePending = false;
    bool volumeSavePending = false;
    uint8_t pendingVolume = 0;
    unsigned long volumeSaveAt = 0;
    String playUrl;
    String playStoragePath;
    String playLabel;
    String playType;
    String playSource;
};

DeferredActions* deferredActions = nullptr;

struct RuntimeAudioAutomation {
    bool startupEffectPending = false;
    bool bootUpdateCheckQueued = false;
    bool updateAvailableHandled = false;
    bool pendingAutoUpdateInstall = false;
    bool lowBatteryCueActive = false;
    bool ambientVolumeApplied = false;
    bool effectVolumeApplied = false;
    bool alarmActive = false;
    bool restartPending = false;
    bool restartFactoryReset = false;
    bool restartForcePending = false;
    bool webUiLockPending = false;
    bool pendingCommandAfterNotification = false;
    bool previewResumePending = false;
    bool resumeSavedPlaybackPending = false;
    uint8_t ambientPreviousVolume = 0;
    uint8_t previewResumeVolume = 0;
    uint8_t startupEffectAttempts = 0;
    unsigned long startupEffectEligibleAt = 0;
    unsigned long ambientEligibleAt = 0;
    unsigned long restartForceAt = 0;
    PlaybackCommand pendingCommand;
    String restartReason;
    String previewResumeUrl;
    String previewResumeLabel;
    String previewResumeType;
    String previewResumeSource;
    String previewActiveSource;
};

