elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    const String rawSelections = settings->ui.peripheralProfileSelections;
    if (rawSelections.isEmpty()) {
        return String("none");
    }

    JsonDocument document;
    if (deserializeJson(document, rawSelections) != DeserializationError::Ok) {
        return String("none");
    }

    JsonArrayConst inputs = document["inputs"].as<JsonArrayConst>();
    if (inputs.isNull() || index >= inputs.size() || !inputs[index].is<const char*>()) {
        return String("none");
    }

    String profile = inputs[index].as<const char*>();
    profile.trim();
    profile.toLowerCase();
    return profile.isEmpty() ? String("none") : profile;
}

String peripheralInputHelperValue(size_t index, const char* key) {
    if (settings == nullptr || key == nullptr || settings->ui.peripheralHelperBindings.isEmpty()) {
        return "";
    }

    JsonDocument document;
    if (deserializeJson(document, settings->ui.peripheralHelperBindings) != DeserializationError::Ok) {
        return "";
    }

    const String slotKey = String("input:") + index;
    JsonObjectConst slot = document[slotKey].as<JsonObjectConst>();
    if (slot.isNull() || !slot[key].is<const char*>()) {
        return "";
    }

    String value = slot[key].as<const char*>();
    value.trim();
    return value;
}

uint8_t configuredInputPin(size_t index, const String& profileValue, uint8_t fallbackPin) {
    String rawValue;
    if (isNativeTouchProfileValue(profileValue)) {
        rawValue = peripheralInputHelperValue(index, "TOUCH");
    } else if (isLimitSwitchProfileValue(profileValue)) {
        rawValue = peripheralInputHelperValue(index, "COM");
        if (rawValue.isEmpty()) {
            rawValue = peripheralInputHelperValue(index, "SIG");
        }
    } else {
        rawValue = peripheralInputHelperValue(index, "SIG");
    }
    const int numericPin = rawValue.isEmpty() ? -1 : rawValue.toInt();
    if (numericPin < 0 || numericPin > 255) {
        return fallbackPin;
    }
    return static_cast<uint8_t>(numericPin);
}

int configuredAssignedInputPin(size_t index, const String& profileValue) {
    String rawValue;
    if (isNativeTouchProfileValue(profileValue)) {
        rawValue = peripheralInputHelperValue(index, "TOUCH");
    } else if (isLimitSwitchProfileValue(profileValue)) {
        rawValue = peripheralInputHelperValue(index, "COM");
        if (rawValue.isEmpty()) {
            rawValue = peripheralInputHelperValue(index, "SIG");
        }
    } else {
        rawValue = peripheralInputHelperValue(index, "SIG");
    }

    const int numericPin = rawValue.isEmpty() ? -1 : rawValue.toInt();
    return (numericPin < 0 || numericPin > 255) ? -1 : numericPin;
}

uint8_t configuredTouchSensitivity(size_t index) {
    const String rawValue = peripheralInputHelperValue(index, "SENSITIVITY");
    const int numericValue = rawValue.isEmpty() ? static_cast<int>(kDefaultTouchSensitivityPercent) : rawValue.toInt();
    if (numericValue < 5) {
        return 5;
    }
    if (numericValue > 100) {
        return 100;
    }
    return static_cast<uint8_t>(numericValue);
}

bool configuredLimitSwitchNormallyClosed(size_t index) {
    String contactValue = peripheralInputHelperValue(index, "CONTACT");
    contactValue.trim();
    contactValue.toUpperCase();
    return contactValue == "NC";
}

bool configuredLimitSwitchSwitchedToVcc(size_t index) {
    String sourceValue = peripheralInputHelperValue(index, "SOURCE");
    sourceValue.trim();
    sourceValue.toUpperCase();
    return sourceValue == "VCC";
}

void configureLimitSwitchInputPin(size_t index) {
    const String profileValue = peripheralInputProfileFromUi(index);
    if (!isLimitSwitchProfileValue(profileValue)) {
        return;
    }

    const int pin = configuredAssignedInputPin(index, profileValue);
    if (pin < 0) {
        return;
    }

    const bool switchedToVcc = configuredLimitSwitchSwitchedToVcc(index);
    pinMode(static_cast<uint8_t>(pin), switchedToVcc ? INPUT_PULLDOWN : INPUT_PULLUP);
}

bool readConfiguredLimitSwitchPressed(size_t index) {
    const String profileValue = peripheralInputProfileFromUi(index);
    if (!isLimitSwitchProfileValue(profileValue)) {
        return false;
    }

    const int pin = configuredAssignedInputPin(index, profileValue);
    if (pin < 0 || sdStorageUsesPin(static_cast<uint8_t>(pin))) {
        return false;
    }

    const bool normallyClosed = configuredLimitSwitchNormallyClosed(index);
    const bool switchedToVcc = configuredLimitSwitchSwitchedToVcc(index);
    const bool activeHigh = switchedToVcc != normallyClosed;
    configureLimitSwitchInputPin(index);
    return (digitalRead(static_cast<uint8_t>(pin)) == HIGH) == activeHigh;
}

bool configuredTouchMainControlEnabled(size_t index) {
    String flagValue = peripheralInputHelperValue(index, "MAIN_CONTROL");
    flagValue.trim();
    flagValue.toLowerCase();
    return flagValue == "1" || flagValue == "true" || flagValue == "on" || flagValue == "yes";
}

const char* motorRuntimeChannelKey(uint8_t channelIndex) {
    return MotorRuntimeConfig::channelKey(channelIndex);
}

const char* motorRuntimeDirectionKey(bool forward) {
    return MotorRuntimeConfig::directionKey(forward);
}

String normalizeMotorLearnedState(String value) {
    return MotorRuntimeConfig::normalizeLearnedState(value);
}

String normalizeTouchMotorAction(String value) {
    return MotorRuntimeConfig::normalizeTouchAction(value);
}

#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
#endif
size_t motorRuntimeConfigJsonCapacity(const String& rawConfig);
bool deserializeMotorRuntimeConfigDocument(const String& rawConfig, DynamicJsonDocument& document);

String configuredTouchMotorAction(uint8_t controlSlot) {
    if (settings == nullptr) {
        return "none";
    }

    DynamicJsonDocument document(motorRuntimeConfigJsonCapacity(settings->ui.motorRuntimeConfig));
    if (!deserializeMotorRuntimeConfigDocument(settings->ui.motorRuntimeConfig, document)) {
        return "none";
    }
    JsonObjectConst touchButtons = document["touchButtons"].as<JsonObjectConst>();
    if (touchButtons.isNull()) {
        return "none";
    }

