elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    const char* buttonKey = controlSlot == 0 ? "button1" : "button2";
    JsonObjectConst buttonConfig = touchButtons[buttonKey].as<JsonObjectConst>();
    return normalizeTouchMotorAction(String(static_cast<const char*>(buttonConfig["action"] | "none")));
}

String movementRoleFromRuntimeConfig(JsonObjectConst channelConfig, bool forward) {
    return MotorRuntimeConfig::movementRole(channelConfig, forward);
}

String learnedStateForMovementRole(const String& role) {
    if (role == "opening") {
        return "open";
    }
    if (role == "closing") {
        return "closed";
    }
    return "unknown";
}

String inferredMotorLearnedState(JsonObjectConst channelStatus, JsonObjectConst channelConfig) {
    if (channelStatus.isNull() || (channelStatus["active"] | false)) {
        return "unknown";
    }

    String stopReason = String(static_cast<const char*>(channelStatus["stopReason"] | ""));
    stopReason.trim();
    stopReason.toLowerCase();
    if (stopReason != "time_limit_reached" && stopReason != "end_switch_activated") {
        return "unknown";
    }

    String lastDirection = String(static_cast<const char*>(channelStatus["lastDirection"] | "forward"));
    lastDirection.trim();
    lastDirection.toLowerCase();
    const bool forward = lastDirection != "backward";
    return learnedStateForMovementRole(movementRoleFromRuntimeConfig(channelConfig, forward));
}

String motorPositionState(JsonObjectConst channelStatus, JsonObjectConst channelConfig, const String& learnedState) {
    if (channelStatus.isNull()) {
        return "idle";
    }

    if (channelStatus["active"] | false) {
        String direction = String(static_cast<const char*>(channelStatus["direction"] | "forward"));
        direction.trim();
        direction.toLowerCase();
        const bool forward = direction != "backward";
        const String role = movementRoleFromRuntimeConfig(channelConfig, forward);
        if (role == "opening" || role == "closing") {
            return role;
        }
        return forward ? String("forward") : String("backward");
    }

    return learnedState == "open" || learnedState == "closed" ? learnedState : String("idle");
}

void appendAugmentedMotorStatus(JsonObject root) {
    if (!motorController.available()) {
        root["available"] = false;
        return;
    }

    motorController.appendStatus(root);
    if (settings == nullptr) {
        return;
    }

    DynamicJsonDocument runtimeConfigDoc(motorRuntimeConfigJsonCapacity(settings->ui.motorRuntimeConfig));
    if (!deserializeMotorRuntimeConfigDocument(settings->ui.motorRuntimeConfig, runtimeConfigDoc)) {
        return;
    }
    JsonArray channels = root["channels"].as<JsonArray>();
    for (uint8_t channelIndex = 0; channelIndex < 2 && channelIndex < channels.size(); ++channelIndex) {
        JsonObject channel = channels[channelIndex].as<JsonObject>();
        if (channel.isNull()) {
            continue;
        }

        JsonObjectConst channelConfig = runtimeConfigDoc[motorRuntimeChannelKey(channelIndex)].as<JsonObjectConst>();
        const String persistedLearnedState = normalizeMotorLearnedState(String(static_cast<const char*>(channelConfig["learnedState"] | "unknown")));
        const String inferredLearnedState = inferredMotorLearnedState(channel, channelConfig);
        String learnedState = inferredLearnedState != "unknown" ? inferredLearnedState : persistedLearnedState;

        const String positionState = motorPositionState(channel, channelConfig, learnedState);
        channel["learnedState"] = learnedState;
        channel["positionState"] = positionState;

        if (!(channel["active"] | false) && learnedState != "unknown") {
            String stopReason = String(static_cast<const char*>(channel["stopReason"] | ""));
            stopReason.trim();
            stopReason.toLowerCase();
            const String label = learnedState == "open" ? String("open") : String("closed");
            if (stopReason == "time_limit_reached") {
                channel["statusText"] = label + ", time limit reached";
            } else if (stopReason == "end_switch_activated") {
                channel["statusText"] = label + ", end switch activated";
            } else {
                channel["statusText"] = label;
            }
        }
    }
}

void applyButtonProfileConfig(PhysicalButtonState& button, size_t index, uint8_t fallbackPin) {
    button.configuredIndex = static_cast<int8_t>(index);
    button.profileValue = peripheralInputProfileFromUi(index);
    button.pin = configuredInputPin(index, button.profileValue, fallbackPin);
    button.limitSwitch = isLimitSwitchProfileValue(button.profileValue);
    button.normallyClosed = button.limitSwitch && configuredLimitSwitchNormallyClosed(index);
    const bool switchedToVcc = button.limitSwitch && configuredLimitSwitchSwitchedToVcc(index);
    button.limitSwitchUsesPullup = button.limitSwitch ? !switchedToVcc : true;
    button.limitSwitchActiveHigh = button.limitSwitch ? (switchedToVcc != button.normallyClosed) : false;
    button.nativeTouch = isNativeTouchProfileValue(button.profileValue);
    button.touchSupported = button.nativeTouch && isTouchCapablePin(button.pin);
    button.mainControlEnabled = isTouchButtonProfileValue(button.profileValue) && configuredTouchMainControlEnabled(index);
    button.sensitivityPercent = configuredTouchSensitivity(index);
    button.touchRawValue = 0;
    button.touchBaselineValue = 0;
    button.touchPressCandidateCount = 0;
    button.touchReleaseCandidateCount = 0;
    button.lastSampledPressed = false;
    button.stablePressed = false;
    button.holdResetTriggered = false;
    button.pressedSinceAt = 0;
}

InputChannelSnapshot inputSnapshotFor(const PhysicalButtonState& button) {
    InputChannelSnapshot snapshot;
    snapshot.configuredIndex = button.configuredIndex;
    snapshot.pin = button.pin;
    snapshot.profile = button.profileValue;
    snapshot.nativeTouch = button.nativeTouch;
    snapshot.touchSupported = button.touchSupported;
    snapshot.active = button.stablePressed;
    snapshot.sensitivityPercent = button.sensitivityPercent;
    snapshot.rawValue = button.touchRawValue;
    snapshot.baselineValue = button.touchBaselineValue;
    return snapshot;
}

void publishInputSnapshots() {
    if (appState == nullptr) {
        return;
    }
    appState->setInputs(inputSnapshotFor(button1), inputSnapshotFor(button2));
}

bool isBatterySamplingAllowed() {
    if (audioPlayer == nullptr) {
        return true;
    }

