elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    const String audioState = audioPlayer->currentState();
    return audioState != "playing" && audioState != "buffering";
}

bool isPhysicalButtonEnabled(const PhysicalButtonState& button) {
    return button.profileValue != "none" && !sdStorageUsesPin(button.pin);
}

void flashFactoryResetIndicator() {
    writeStatusLedColor(kStatusLedBrightness, 0, 0);
    delay(500);
    writeStatusLed(false);
}

bool isAnyTouchInputPressed() {
    return (isTouchButtonProfileValue(button1.profileValue) && button1.stablePressed) ||
        (isTouchButtonProfileValue(button2.profileValue) && button2.stablePressed);
}

bool isFactoryResetLedBlinkActive(unsigned long now) {
    return factoryResetLedBlinkUntil != 0 && static_cast<long>(now - factoryResetLedBlinkUntil) < 0;
}

void startFactoryResetLedBlink(unsigned long now, unsigned long durationMs = kFactoryResetLedSuccessWindowMs) {
    factoryResetLedBlinkUntil = now + durationMs;
}

void serviceStatusLedOverrides(unsigned long now) {
    if (isFactoryResetLedBlinkActive(now)) {
        touchStatusLedOverrideActive = false;
        const bool flashOn = ((now / kFactoryResetLedBlinkIntervalMs) % 2UL) == 0;
        writeStatusLedColor(flashOn ? kStatusLedBrightness : 0, 0, 0);
        return;
    }
    if (factoryResetLedBlinkUntil != 0) {
        factoryResetLedBlinkUntil = 0;
        touchStatusLedOverrideActive = false;
        updateStatusLedForNetwork(wifiManager != nullptr && wifiManager->isConnected(), wifiManager != nullptr && wifiManager->isApMode(), now);
        return;
    }
    if (isAnyTouchInputPressed()) {
        touchStatusLedOverrideActive = true;
        writeStatusLedColor(0, kStatusLedBrightness, 0);
        return;
    }
    if (touchStatusLedOverrideActive) {
        touchStatusLedOverrideActive = false;
        updateStatusLedForNetwork(wifiManager != nullptr && wifiManager->isConnected(), wifiManager != nullptr && wifiManager->isApMode(), now);
    }
}

void triggerTouchHoldFactoryReset(PhysicalButtonState& button) {
    if (button.holdResetTriggered) {
        return;
    }

    button.holdResetTriggered = true;
    Serial.printf("[input] %s held on GPIO%u for %lu ms, triggering factory reset\n",
                  button.label,
                  static_cast<unsigned>(button.pin),
                  static_cast<unsigned long>(kTouchFactoryResetHoldMs));
    if (displayManager != nullptr) {
        displayManager->showTemporaryCenterText("Factory Reset", 1500UL);
    }
    if (appState != nullptr) {
        appState->setLastError("Touch hold reset: restoring default settings.");
    }
    factoryResetRequested = true;
    scheduleReboot(kFactoryResetLedSuccessWindowMs + 250UL);
}

void serviceTouchHoldFactoryReset(PhysicalButtonState& button, unsigned long now) {
    if (settings == nullptr || !settings->device.touchHoldFactoryResetEnabled ||
        !button.mainControlEnabled ||
        !isTouchButtonProfileValue(button.profileValue) || !button.stablePressed || button.pressedSinceAt == 0 ||
        rebootRequested || factoryResetRequested || button.holdResetTriggered) {
        return;
    }

    if ((now - button.pressedSinceAt) >= kTouchFactoryResetHoldMs) {
        triggerTouchHoldFactoryReset(button);
    }
}

const char* resetReasonToString(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_UNKNOWN:
            return "unknown";
        case ESP_RST_POWERON:
            return "poweron";
        case ESP_RST_EXT:
            return "external";
        case ESP_RST_SW:
            return "software";
        case ESP_RST_PANIC:
            return "panic";
        case ESP_RST_INT_WDT:
            return "interrupt watchdog";
        case ESP_RST_TASK_WDT:
            return "task watchdog";
        case ESP_RST_WDT:
            return "other watchdog";
        case ESP_RST_DEEPSLEEP:
            return "deepsleep";
        case ESP_RST_BROWNOUT:
            return "brownout";
        case ESP_RST_SDIO:
            return "sdio";
        default:
            return "unhandled";
    }
}

String normalizedAppVersion() {
    return String("v") + APP_VERSION;
}

String readPreferenceStringIfPresent(Preferences& prefs, const char* key) {
    return prefs.isKey(key) ? prefs.getString(key, "") : String("");
}

void removePreferenceIfPresent(Preferences& prefs, const char* key) {
    if (prefs.isKey(key)) {
        prefs.remove(key);
    }
}

bool isPowerCycleResetReason(esp_reset_reason_t reason) {
    return reason == ESP_RST_POWERON || reason == ESP_RST_BROWNOUT;
}

void clearPowerCycleCounter() {
    Preferences prefs;
    if (!prefs.begin(kPowerCycleNamespace, false)) {
        return;
    }
    removePreferenceIfPresent(prefs, kPowerCycleCountKey);
    prefs.end();
}

uint8_t updatePowerCycleCounter(esp_reset_reason_t resetReason) {
    Preferences prefs;
    if (!prefs.begin(kPowerCycleNamespace, false)) {
        return 0;
    }

    uint8_t count = 0;
    if (isPowerCycleResetReason(resetReason)) {
        count = prefs.getUChar(kPowerCycleCountKey, 0);
        if (count < 255) {
            count += 1;
        }
        prefs.putUChar(kPowerCycleCountKey, count);
    } else {
        removePreferenceIfPresent(prefs, kPowerCycleCountKey);
    }

    prefs.end();
    return count;
}

void armPowerCycleCounterClear() {
    powerCycleCounterClearArmed = true;
    powerCycleCounterClearAt = millis() + kPowerCycleCounterClearDelayMs;
}

void maybeClearPowerCycleCounterAfterStableBoot() {
    if (!powerCycleCounterClearArmed || static_cast<long>(millis() - powerCycleCounterClearAt) < 0) {
        return;
    }
    clearPowerCycleCounter();
    powerCycleCounterClearArmed = false;
    Serial.println("[boot-guard] power-cycle counter cleared after stable uptime");
}

void storeRollbackPendingInfo(const String& version, const String& reason) {
    Preferences prefs;
    if (!prefs.begin(kOtaRollbackNamespace, false)) {
        return;
    }
    prefs.putString(kOtaPendingVersionKey, version);
    prefs.putString(kOtaPendingReasonKey, reason);
    prefs.end();
}

void clearRollbackPendingInfo() {
    Preferences prefs;
    if (!prefs.begin(kOtaRollbackNamespace, false)) {
        return;
    }
    removePreferenceIfPresent(prefs, kOtaPendingVersionKey);
    removePreferenceIfPresent(prefs, kOtaPendingReasonKey);
    prefs.end();
}

void persistRollbackOutcome(const String& version, const String& reason) {
    Preferences prefs;
    if (!prefs.begin(kOtaRollbackNamespace, false)) {
        return;
    }
    prefs.putString(kOtaLastBadVersionKey, version);
    prefs.putString(kOtaLastBadReasonKey, reason);
    prefs.end();
}

void loadRollbackState() {
    Preferences prefs;
    if (!prefs.begin(kOtaRollbackNamespace, false)) {
        return;
    }

