elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    otaPendingVersion = readPreferenceStringIfPresent(prefs, kOtaPendingVersionKey);
    String pendingReason = readPreferenceStringIfPresent(prefs, kOtaPendingReasonKey);
    lastRolledBackVersion = readPreferenceStringIfPresent(prefs, kOtaLastBadVersionKey);
    lastRollbackReason = readPreferenceStringIfPresent(prefs, kOtaLastBadReasonKey);

    const String currentVersion = normalizedAppVersion();
    const esp_partition_t* runningPartition = esp_ota_get_running_partition();
    esp_ota_img_states_t otaState = ESP_OTA_IMG_UNDEFINED;
    if (runningPartition != nullptr && esp_ota_get_state_partition(runningPartition, &otaState) == ESP_OK && otaState == ESP_OTA_IMG_PENDING_VERIFY) {
        otaPendingVerification = true;
        otaBootStartedAt = millis();
        otaHealthConfirmed = false;
        otaPendingVersion = currentVersion;
        if (pendingReason.isEmpty()) {
            pendingReason = "App booted but did not finish health confirmation.";
        }
        prefs.putString(kOtaPendingVersionKey, otaPendingVersion);
        prefs.putString(kOtaPendingReasonKey, pendingReason);
    } else {
        otaPendingVerification = false;
        otaHealthConfirmed = true;
        if (!otaPendingVersion.isEmpty() && otaPendingVersion != currentVersion) {
            lastRolledBackVersion = otaPendingVersion;
            if (pendingReason.isEmpty()) {
                pendingReason = "New firmware rebooted before health confirmation; bootloader rolled back.";
            }
            lastRollbackReason = pendingReason;
            prefs.putString(kOtaLastBadVersionKey, lastRolledBackVersion);
            prefs.putString(kOtaLastBadReasonKey, lastRollbackReason);
        }
        removePreferenceIfPresent(prefs, kOtaPendingVersionKey);
        removePreferenceIfPresent(prefs, kOtaPendingReasonKey);
        otaPendingVersion = "";
    }

    prefs.end();
}

void refreshRollbackStateInOtaManager() {
    if (otaManager == nullptr) {
        return;
    }
    otaManager->setRollbackState(otaPendingVerification && !otaHealthConfirmed, otaPendingVersion, lastRolledBackVersion, lastRollbackReason);
}

void initializeWapeTriggerPin() {
    if (activeWapeTriggerPin == 0) {
        wapeTriggerInitialized = false;
        return;
    }
    pinMode(activeWapeTriggerPin, OUTPUT);
    digitalWrite(activeWapeTriggerPin, HIGH);
    wapeTriggerInitialized = true;
}

void applyWapeTriggerPin(uint8_t pin) {
    if (wapeTriggerInitialized && activeWapeTriggerPin != 0 && activeWapeTriggerPin != pin) {
        digitalWrite(activeWapeTriggerPin, HIGH);
        pinMode(activeWapeTriggerPin, INPUT);
    }

    activeWapeTriggerPin = pin;
    wapePulseActive = false;

    if (pin == 0) {
        wapeTriggerInitialized = false;
        return;
    }

    initializeWapeTriggerPin();
}

bool isWapeDisplayActive() {
    return settings != nullptr && settings->oled.displayType == "wape" && activeWapeTriggerPin != 0;
}

void requestWapeTriggerPulse() {
    if (!isWapeDisplayActive()) {
        return;
    }
    if (!wapeTriggerInitialized) {
        initializeWapeTriggerPin();
    }
    digitalWrite(activeWapeTriggerPin, LOW);
    wapePulseActive = true;
    wapePulseReleaseAt = millis() + kWapePulseDurationMs;
}

void triggerWapeDisplay() {
    requestWapeTriggerPulse();
}

void serviceWapeTriggerPulse() {
    if (!wapePulseActive) {
        return;
    }
    if (static_cast<long>(millis() - wapePulseReleaseAt) < 0) {
        return;
    }
    if (wapeTriggerInitialized && activeWapeTriggerPin != 0) {
        digitalWrite(activeWapeTriggerPin, HIGH);
    }
    wapePulseActive = false;
}

[[noreturn]] void rollbackAndReboot(const String& reason) {
    const String version = otaPendingVersion.isEmpty() ? normalizedAppVersion() : otaPendingVersion;
    storeRollbackPendingInfo(version, reason);
    persistRollbackOutcome(version, reason);
    Serial.printf("[rollback] %s\n", reason.c_str());
    Serial.flush();
    const esp_err_t result = esp_ota_mark_app_invalid_rollback_and_reboot();
    Serial.printf("[rollback] esp_ota_mark_app_invalid_rollback_and_reboot failed: %d\n", static_cast<int>(result));
    Serial.flush();
    delay(1000);
    ESP.restart();
    for (;;) {
        delay(1000);
    }
}

void confirmOtaHealthIfReady() {
    if (!otaPendingVerification || otaHealthConfirmed) {
        return;
    }
    if ((millis() - otaBootStartedAt) < kOtaHealthConfirmDelayMs) {
        return;
    }
    if (rebootRequested || factoryResetRequested || recoveryRebootScheduled) {
        return;
    }

    const esp_err_t result = esp_ota_mark_app_valid_cancel_rollback();
    if (result == ESP_OK) {
        otaHealthConfirmed = true;
        otaPendingVerification = false;
        otaPendingVersion = "";
        clearRollbackPendingInfo();
        refreshRollbackStateInOtaManager();
        Serial.println("[rollback] OTA firmware marked healthy");
        Serial.flush();
    } else {
        Serial.printf("[rollback] failed to confirm OTA app: %d\n", static_cast<int>(result));
        Serial.flush();
    }
}

void scheduleReboot(uint32_t delayMs) {
    rebootRequested = true;
    rebootAt = millis() + delayMs;
}

String effectFileForSource(const String& source) {
    if (settings == nullptr) {
        return "";
    }
    if (source == "effect-startup") return settings->effects.startupFile;
    if (source == "effect-alarm") return settings->effects.alarmFile;
    if (source == "effect-notification") return settings->effects.notificationFile;
    if (source == "effect-ambient") return settings->effects.ambientSoundFile;
    if (source == "effect-low-battery") return settings->effects.lowBatteryFile;
    if (source == "effect-shutdown") return settings->effects.shutDownFile;
    if (source == "effect-update-available") return settings->effects.updateAvailableFile;
    if (source == "effect-update-success") return settings->effects.updateSuccessFile;
    return "";
}

uint8_t effectVolumeForSource(const String& source) {
    if (settings == nullptr) {
        return DefaultConfig::DEFAULT_VOLUME_PERCENT;
    }
    if (source == "effect-startup") return settings->effects.startupVolumePercent;
    if (source == "effect-alarm") return settings->effects.alarmVolumePercent;
    if (source == "effect-notification") return settings->effects.notificationVolumePercent;
    if (source == "effect-ambient") return settings->effects.ambientVolumePercent;
    if (source == "effect-low-battery") return settings->effects.lowBatteryVolumePercent;
    if (source == "effect-shutdown") return settings->effects.shutDownVolumePercent;
    if (source == "effect-update-available") return settings->effects.updateAvailableVolumePercent;
    if (source == "effect-update-success") return settings->effects.updateSuccessVolumePercent;
    return settings->device.savedVolumePercent;
}

void restoreEffectVolumeIfNeeded() {
    if (!runtimeAudio.effectVolumeApplied || audioPlayer == nullptr) {
        return;
    }
    audioPlayer->setVolumePercent(settings != nullptr ? settings->device.savedVolumePercent : DefaultConfig::DEFAULT_VOLUME_PERCENT);
    runtimeAudio.effectVolumeApplied = false;
}

