elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    if (action == "none" || action == "previous" || action == "next" || action == "play_pause" ||
        action == "replay_current" || action == "stop" || action == "volume_up" || action == "volume_down" ||
        action == "ha_previous" || action == "ha_next" || action == "toggle_open" || action == "toggle_close" || action == "toggle_open_close") {
        return action;
    }

    return String(fallback);
}

String buttonActionFor(const PhysicalButtonState& button) {
    if (isTouchButtonProfileValue(button.profileValue)) {
        const String touchMotorAction = configuredTouchMotorAction(button.controlSlot);
        if (touchMotorAction != "none") {
            return touchMotorAction;
        }
    }

    if (settings == nullptr) {
        return button.controlSlot == 0 ? String(DefaultConfig::BUTTON1_DEFAULT_ACTION) : String(DefaultConfig::BUTTON2_DEFAULT_ACTION);
    }

    return button.controlSlot == 0
        ? normalizedButtonAction(settings->device.button1Action, DefaultConfig::BUTTON1_DEFAULT_ACTION)
        : normalizedButtonAction(settings->device.button2Action, DefaultConfig::BUTTON2_DEFAULT_ACTION);
}

int resolveMainControlInputIndex() {
    for (size_t index = 0; index < kMaxPeripheralInputProfiles; ++index) {
        const String profile = peripheralInputProfileFromUi(index);
        if (isTouchButtonProfileValue(profile) && configuredTouchMainControlEnabled(index)) {
            return static_cast<int>(index);
        }
    }
    return -1;
}

int resolveSecondaryInputIndex(int excludedIndex, int fallbackIndex) {
    for (size_t index = 0; index < kMaxPeripheralInputProfiles; ++index) {
        if (static_cast<int>(index) == excludedIndex) {
            continue;
        }
        if (peripheralInputProfileFromUi(index) != "none") {
            return static_cast<int>(index);
        }
    }
    return fallbackIndex;
}

String buttonActionDisplayLabel(const String& action) {
    if (action == "none") {
        return "Disabled";
    }
    if (action == "previous") {
        return "Previous";
    }
    if (action == "next") {
        return "Next";
    }
    if (action == "play_pause") {
        return "Play/Pause";
    }
    if (action == "replay_current") {
        return "Replay";
    }
    if (action == "stop") {
        return "Stop";
    }
    if (action == "volume_up") {
        return "Volume +";
    }
    if (action == "volume_down") {
        return "Volume -";
    }
    if (action == "ha_previous") {
        return "HA Prev";
    }
    if (action == "ha_next") {
        return "HA Next";
    }
    if (action == "toggle_open") {
        return "Open";
    }
    if (action == "toggle_close") {
        return "Close";
    }
    if (action == "toggle_open_close") {
        return "Open/Close";
    }
    return action;
}

bool motorChannelConfigured(uint8_t channelIndex) {
    JsonDocument motorDoc;
    appendAugmentedMotorStatus(motorDoc.to<JsonObject>());
    JsonArrayConst channels = motorDoc["channels"].as<JsonArrayConst>();
    return channelIndex < channels.size() && !channels[channelIndex].isNull() && (channels[channelIndex]["configured"] | false);
}

int8_t resolveTouchMotorChannelIndex(const PhysicalButtonState& button) {
    if (button.controlSlot < 2 && motorChannelConfigured(button.controlSlot)) {
        return static_cast<int8_t>(button.controlSlot);
    }
    for (uint8_t channelIndex = 0; channelIndex < 2; ++channelIndex) {
        if (motorChannelConfigured(channelIndex)) {
            return static_cast<int8_t>(channelIndex);
        }
    }
    return -1;
}

struct TouchMotorRunConfig {
    bool forward = true;
    uint32_t durationMs = 5000;
    int8_t limitInputIndex = -1;
};

uint32_t clampPersistedMotorDuration(uint32_t durationMs);

TouchMotorRunConfig touchMotorRunConfigForDirection(uint8_t channelIndex, bool openDirection) {
    TouchMotorRunConfig config;
    if (settings == nullptr) {
        config.forward = openDirection;
        return config;
    }

    JsonDocument document;
    const String runtimeConfigJson = settings->ui.motorRuntimeConfig.isEmpty() ? String("{}") : settings->ui.motorRuntimeConfig;
    deserializeJson(document, runtimeConfigJson);
    JsonObjectConst channel = document[motorRuntimeChannelKey(channelIndex)].as<JsonObjectConst>();

    const auto applyDirectionConfig = [&](const char* directionKey, bool forwardDirection) {
        JsonObjectConst direction = channel[directionKey].as<JsonObjectConst>();
        config.forward = forwardDirection;
        config.durationMs = clampPersistedMotorDuration(direction["durationMs"] | config.durationMs);
        config.limitInputIndex = direction["limitInputIndex"].isNull()
            ? static_cast<int8_t>(-1)
            : static_cast<int8_t>(direction["limitInputIndex"].as<int>());
    };

    const String targetRole = openDirection ? String("opening") : String("closing");
    const String forwardRole = movementRoleFromRuntimeConfig(channel, true);
    const String backwardRole = movementRoleFromRuntimeConfig(channel, false);
    if (forwardRole == targetRole && backwardRole != targetRole) {
        applyDirectionConfig("forward", true);
    } else if (backwardRole == targetRole && forwardRole != targetRole) {
        applyDirectionConfig("backward", false);
    } else {
        applyDirectionConfig(openDirection ? "forward" : "backward", openDirection);
    }

    return config;
}

String learnedMotorStateForChannel(uint8_t channelIndex) {
    if (settings == nullptr) {
        return "unknown";
    }

    JsonDocument document;
    const String runtimeConfigJson = settings->ui.motorRuntimeConfig.isEmpty() ? String("{}") : settings->ui.motorRuntimeConfig;
    deserializeJson(document, runtimeConfigJson);
    JsonObjectConst channel = document[motorRuntimeChannelKey(channelIndex)].as<JsonObjectConst>();
    return normalizeMotorLearnedState(String(static_cast<const char*>(channel["learnedState"] | "unknown")));
}

bool runTouchMotorAction(const PhysicalButtonState& button, const String& action) {
    const int8_t channelIndex = resolveTouchMotorChannelIndex(button);
    if (channelIndex < 0) {
        if (appState != nullptr) {
            appState->setLastError("No configured motor channel is available for touch control.");
        }
        return false;
    }

