elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    bool openDirection = true;
    if (action == "toggle_close") {
        openDirection = false;
    } else if (action == "toggle_open_close") {
        openDirection = learnedMotorStateForChannel(static_cast<uint8_t>(channelIndex)) != "open";
    }

    const TouchMotorRunConfig config = touchMotorRunConfigForDirection(static_cast<uint8_t>(channelIndex), openDirection);
    String error;
    if (!motorController.runChannel(static_cast<uint8_t>(channelIndex), config.forward, config.durationMs, config.limitInputIndex, error)) {
        if (appState != nullptr) {
            appState->setLastError(error.isEmpty() ? String("Motor command failed.") : error);
        }
        return false;
    }

    if (appState != nullptr) {
        appState->setLastError("");
    }
    if (mqttManager != nullptr) {
        mqttManager->publishState();
    }
    return true;
}

String buttonOverlayText(const String& action) {
    if ((action == "volume_up" || action == "volume_down") && settings != nullptr) {
        String label = "Volume ";
        label += settings->device.savedVolumePercent;
        label += "%";
        return label;
    }

    return buttonActionDisplayLabel(action);
}

void showS3ButtonActionOnDisplay(const String& action) {
#if defined(CONFIG_IDF_TARGET_ESP32S3)
    if (displayManager != nullptr) {
        displayManager->showTemporaryCenterText(buttonOverlayText(action));
    }
#else
    (void)action;
#endif
}

void initializeButtons() {
    const unsigned long now = millis();
    const uint8_t defaultButton1Pin = DefaultConfig::BUTTON1_PIN;
    const uint8_t defaultButton2Pin = DefaultConfig::BUTTON2_PIN;
    button1.controlSlot = 0;
    button2.controlSlot = 1;
    const int mainControlIndex = resolveMainControlInputIndex();
    const int primaryIndex = mainControlIndex >= 0 ? mainControlIndex : 0;
    const int secondaryIndex = resolveSecondaryInputIndex(primaryIndex, 1);
    applyButtonProfileConfig(button1, static_cast<size_t>(primaryIndex), defaultButton1Pin);
    applyButtonProfileConfig(button2, static_cast<size_t>(secondaryIndex), defaultButton2Pin);

    if (isPhysicalButtonEnabled(button1)) {
        if (button1.touchSupported) {
            button1.touchRawValue = touchRead(button1.pin);
            button1.touchBaselineValue = button1.touchRawValue;
            button1.lastSampledPressed = false;
        } else if (button1.limitSwitch) {
            pinMode(button1.pin, button1.limitSwitchUsesPullup ? INPUT_PULLUP : INPUT_PULLDOWN);
            button1.lastSampledPressed = false;
        } else {
            pinMode(button1.pin, INPUT_PULLDOWN);
            button1.lastSampledPressed = digitalRead(button1.pin) == HIGH;
        }
    } else {
        pinMode(button1.pin, INPUT);
        button1.lastSampledPressed = false;
    }
    button1.stablePressed = button1.lastSampledPressed;
    button1.holdResetTriggered = false;
    button1.pressedSinceAt = button1.stablePressed ? now : 0;
    button1.lastTransitionAt = now;

    if (isPhysicalButtonEnabled(button2)) {
        if (button2.touchSupported) {
            button2.touchRawValue = touchRead(button2.pin);
            button2.touchBaselineValue = button2.touchRawValue;
            button2.lastSampledPressed = false;
        } else if (button2.limitSwitch) {
            pinMode(button2.pin, button2.limitSwitchUsesPullup ? INPUT_PULLUP : INPUT_PULLDOWN);
            button2.lastSampledPressed = false;
        } else {
            pinMode(button2.pin, INPUT_PULLDOWN);
            button2.lastSampledPressed = digitalRead(button2.pin) == HIGH;
        }
    } else {
        pinMode(button2.pin, INPUT);
        button2.lastSampledPressed = false;
    }
    button2.stablePressed = button2.lastSampledPressed;
    button2.holdResetTriggered = false;
    button2.pressedSinceAt = button2.stablePressed ? now : 0;
    button2.lastTransitionAt = now;

    for (size_t index = 0; index < kMaxPeripheralInputProfiles; ++index) {
        configureLimitSwitchInputPin(index);
    }

    publishInputSnapshots();
}

void rememberPlaybackSelection(const String& url, const String& label, const String& type, const String& source) {
    const String normalizedUrl = canonicalPlaybackReference(url);
    StorageTarget storageTarget = StorageTarget::Flash;
    String storagePath;
    const bool storageReference = parseStorageFileReference(normalizedUrl, storageTarget, storagePath);
    const String normalizedLabel = storageReference
        ? PlaybackText::normalizeTitle(label, storagePath)
        : PlaybackText::normalizeTitle(label, normalizedUrl);

    if (normalizedUrl.isEmpty()) {
        return;
    }

    if (playbackHistoryIndex >= 0 && playbackHistoryIndex < static_cast<int>(playbackHistoryCount)) {
        PlaybackHistoryEntry& current = playbackHistory[playbackHistoryIndex];
        if (current.url == normalizedUrl && current.type == type) {
            current.label = normalizedLabel;
            current.source = source;
            return;
        }
    }

    if (playbackHistoryIndex >= 0 && playbackHistoryIndex < static_cast<int>(playbackHistoryCount - 1)) {
        playbackHistoryCount = static_cast<size_t>(playbackHistoryIndex + 1);
    }

    if (playbackHistoryCount > 0) {
        PlaybackHistoryEntry& last = playbackHistory[playbackHistoryCount - 1];
        if (last.url == normalizedUrl && last.type == type) {
            last.label = normalizedLabel;
            last.source = source;
            playbackHistoryIndex = static_cast<int>(playbackHistoryCount - 1);
            return;
        }
    }

    if (playbackHistoryCount == kPlaybackHistoryLimit) {
        for (size_t index = 1; index < playbackHistoryCount; ++index) {
            playbackHistory[index - 1] = playbackHistory[index];
        }
        playbackHistoryCount -= 1;
    }

    playbackHistory[playbackHistoryCount] = {normalizedUrl, normalizedLabel, type, source};
    playbackHistoryCount += 1;
    playbackHistoryIndex = static_cast<int>(playbackHistoryCount - 1);
}

