elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
void publishOtaStateIfNeeded(const AppStateSnapshot& snapshot) {
    if (mqttManager == nullptr || !mqttManager->isConnected()) {
        return;
    }

    const String otaSignature = String(snapshot.ota.busy ? '1' : '0') + "|" + snapshot.ota.latestVersion + "|" +
        snapshot.ota.lastResult + "|" + snapshot.ota.lastError + "|" + snapshot.ota.phase + "|" + snapshot.ota.progressPercent;
    if (otaSignature == lastPublishedOtaSignature) {
        return;
    }

    const unsigned long now = millis();
    if ((now - lastOtaMqttPublishAt) < 500UL && snapshot.ota.busy) {
        return;
    }

    lastPublishedOtaSignature = otaSignature;
    lastOtaMqttPublishAt = now;
    mqttManager->publishState();
}

void pumpOtaDisplayProgress() {
    if (appState == nullptr || displayManager == nullptr) {
        return;
    }
    const AppStateSnapshot snapshot = appState->snapshot();
    displayManager->loop(snapshot);
    publishOtaStateIfNeeded(snapshot);
}

bool initializeRuntimeObjects() {
    if (appState == nullptr) {
        appState = allocatePreferPsram<AppState>();
    }
    if (settingsManager == nullptr) {
        settingsManager = allocatePreferPsram<SettingsManager>();
    }
    if (settings == nullptr) {
        settings = allocatePreferPsram<SettingsBundle>();
    }
    if (wifiManager == nullptr) {
        wifiManager = allocatePreferPsram<WiFiManager>();
    }
    if (batteryMonitor == nullptr) {
        batteryMonitor = allocatePreferPsram<BatteryMonitor>();
    }
    if (displayManager == nullptr) {
        displayManager = allocatePreferPsram<DisplayManager>();
    }
    if (audioPlayer == nullptr) {
        audioPlayer = allocatePreferPsram<AudioPlayerType>();
    }
    if (otaManager == nullptr) {
        otaManager = allocatePreferPsram<OtaManager>();
    }
    if (mqttManager == nullptr) {
        mqttManager = allocatePreferPsram<MqttManager>();
    }
    if (webServer == nullptr) {
        webServer = allocatePreferPsram<WebServerManager>();
    }
    if (soundEffects == nullptr) {
        soundEffects = allocatePreferPsram<SoundEffectsManager>();
    }
    if (deferredActions == nullptr) {
        deferredActions = allocatePreferPsram<DeferredActions>();
    }

    return appState != nullptr && settingsManager != nullptr && settings != nullptr && wifiManager != nullptr &&
           batteryMonitor != nullptr && displayManager != nullptr && audioPlayer != nullptr && otaManager != nullptr &&
           mqttManager != nullptr && webServer != nullptr && soundEffects != nullptr && deferredActions != nullptr;
}

void applyRuntimeSettings() {
    applyStorageSettings(*settings);
    initializeButtons();
    motorController.applySettings(*settings);
    appState->setDevice(settings->device.deviceName, settings->device.friendlyName, settings->usingSavedSettings);
    applyStatusLedPin(settings->device.statusLedPin);
    applyWapeTriggerPin(settings->oled.displayType == "wape" ? settings->oled.wapeTriggerPin : 0);
    wifiManager->applySettings(*settings);
    batteryMonitor->applySettings(settings->battery, settings->battery.adcPin);
    displayManager->applySettings(settings->oled);
    if (!settings->audio.enabled) {
        if (activeAudioOutputEnabled) {
            audioPlayer->disableOutput();
            activeAudioOutputEnabled = false;
        }
    } else if (!activeAudioOutputEnabled || settings->audio.bclkPin != activeI2sBclkPin || settings->audio.wsPin != activeI2sWsPin || settings->audio.doutPin != activeI2sDoutPin) {
        if (audioPlayer->reconfigureOutputPins(settings->audio.bclkPin, settings->audio.wsPin, settings->audio.doutPin)) {
            activeI2sBclkPin = settings->audio.bclkPin;
            activeI2sWsPin = settings->audio.wsPin;
            activeI2sDoutPin = settings->audio.doutPin;
            activeAudioOutputEnabled = true;
        }
    }
#if APP_AUDIO_DIAGNOSTIC_TEST
    audioPlayer->setDirectLibraryVolume(DefaultConfig::AUDIO_DIAGNOSTIC_LIBRARY_VOLUME);
#else
    const AppStateSnapshot snapshot = appState->snapshot();
    if (snapshot.playback.source == "effect-ambient") {
        runtimeAudio.ambientPreviousVolume = settings->device.savedVolumePercent;
        audioPlayer->setVolumePercent(ambientPlaybackVolumePercent());
        runtimeAudio.ambientVolumeApplied = true;
        runtimeAudio.effectVolumeApplied = false;
    } else if (snapshot.playback.source.startsWith("effect-")) {
        audioPlayer->setVolumePercent(effectVolumeForSource(snapshot.playback.source));
        runtimeAudio.effectVolumeApplied = true;
        runtimeAudio.ambientVolumeApplied = false;
    } else {
        audioPlayer->setVolumePercent(settings->device.savedVolumePercent);
        runtimeAudio.ambientVolumeApplied = false;
        runtimeAudio.effectVolumeApplied = false;
    }
#endif
    soundEffects->applySettings(*settings);
    mqttManager->applySettings(*settings);
    otaManager->applySettings(*settings);
    runtimeAudio.ambientEligibleAt = millis() + kAmbientResumeDelayMs;
    runtimeAudio.updateAvailableHandled = false;
    sampleSystemMetrics();

    // Repaint the current status immediately on the newly selected LED pin so
    // the pin change is visible right after Save Device Settings.
    updateStatusLedForNetwork(wifiManager->isConnected(), wifiManager->isApMode());
}

void preserveLearnedMotorStates(SettingsBundle& target, const SettingsBundle& source) {
    DynamicJsonDocument sourceDoc(motorRuntimeConfigJsonCapacity(source.ui.motorRuntimeConfig));
    if (!deserializeMotorRuntimeConfigDocument(source.ui.motorRuntimeConfig, sourceDoc)) {
        return;
    }

    DynamicJsonDocument targetDoc(motorRuntimeConfigJsonCapacity(target.ui.motorRuntimeConfig));
    if (!deserializeMotorRuntimeConfigDocument(target.ui.motorRuntimeConfig, targetDoc)) {
        return;
    }

    bool changed = false;
    for (uint8_t channelIndex = 0; channelIndex < 2; ++channelIndex) {
        const char* channelKey = motorRuntimeChannelKey(channelIndex);
        JsonObjectConst sourceChannel = sourceDoc[channelKey].as<JsonObjectConst>();
        JsonObject targetChannel = targetDoc[channelKey].as<JsonObject>();
        if (targetChannel.isNull()) {
            targetChannel = targetDoc[channelKey].to<JsonObject>();
        }

