elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
        for (const char* directionKey : {"forward", "backward"}) {
            JsonObjectConst sourceDirection = sourceChannel[directionKey].as<JsonObjectConst>();
            JsonObjectConst targetDirection = targetChannel[directionKey].as<JsonObjectConst>();
            if (!sourceDirection.isNull() && targetDirection.isNull()) {
                targetChannel[directionKey].set(sourceDirection);
                changed = true;
            }
        }

        const String sourceState = normalizeMotorLearnedState(String(static_cast<const char*>(sourceChannel["learnedState"] | "unknown")));
        if (sourceState == "unknown") {
            continue;
        }

        const String targetState = normalizeMotorLearnedState(String(static_cast<const char*>(targetChannel["learnedState"] | "unknown")));
        if (targetState != "unknown") {
            continue;
        }

        if (targetChannel["forward"].isNull() && targetChannel["backward"].isNull()) {
            continue;
        }

        targetChannel["learnedState"] = sourceState;
        changed = true;
    }

    JsonObjectConst sourceTouchButtons = sourceDoc["touchButtons"].as<JsonObjectConst>();
    JsonObjectConst targetTouchButtons = targetDoc["touchButtons"].as<JsonObjectConst>();
    if (!sourceTouchButtons.isNull() && targetTouchButtons.isNull()) {
        targetDoc["touchButtons"].set(sourceTouchButtons);
        changed = true;
    }

    if (!changed) {
        return;
    }

    String serialized;
    serializeJson(targetDoc.as<JsonObjectConst>(), serialized);
    target.ui.motorRuntimeConfig = serialized;
}

bool extractMotorRuntimeConfigFromJson(JsonVariantConst root, String& rawConfig) {
    if (!root.is<JsonObjectConst>()) {
        return false;
    }

    JsonObjectConst ui = root["ui"].as<JsonObjectConst>();
    if (ui.isNull()) {
        return false;
    }

    JsonVariantConst value = ui["motorRuntimeConfig"];
    if (value.isNull()) {
        return false;
    }

    rawConfig = "";
    if (value.is<JsonObjectConst>() || value.is<JsonArrayConst>()) {
        serializeJson(value, rawConfig);
    } else {
        const char* rawValue = value.as<const char*>();
        if (rawValue != nullptr) {
            rawConfig = rawValue;
        } else {
            String serializedValue;
            serializeJson(value, serializedValue);
            if (serializedValue.length() >= 2 && serializedValue.charAt(0) == '"' && serializedValue.charAt(serializedValue.length() - 1) == '"') {
                DynamicJsonDocument decodedValue(serializedValue.length() * 2U + 64U);
                if (!deserializeJson(decodedValue, serializedValue) && decodedValue.is<const char*>()) {
                    rawConfig = decodedValue.as<const char*>();
                }
            }
            if (rawConfig.isEmpty()) {
                rawConfig = serializedValue;
            }
        }
    }

    if (rawConfig.isEmpty()) {
        return false;
    }
    rawConfig.trim();
    return !rawConfig.isEmpty();
}

bool saveSettingsFromJson(JsonVariantConst root, String& error) {
    String postedMotorRuntimeConfig;
    const bool hasPostedMotorRuntimeConfig = extractMotorRuntimeConfigFromJson(root, postedMotorRuntimeConfig);
    postedMotorRuntimeConfig.trim();

    SettingsBundle updated = *settings;
    if (!settingsManager->updateFromJson(updated, root, error)) {
        return false;
    }
    if (hasPostedMotorRuntimeConfig) {
        updated.ui.motorRuntimeConfig = postedMotorRuntimeConfig.isEmpty() ? String("{}") : postedMotorRuntimeConfig;
    } else {
        preserveLearnedMotorStates(updated, *settings);
    }
    updated.usingSavedSettings = true;
    settingsManager->save(updated);

    SettingsBundle persisted = settingsManager->load();
    if (hasPostedMotorRuntimeConfig && persisted.ui.motorRuntimeConfig != updated.ui.motorRuntimeConfig) {
        persisted.ui.motorRuntimeConfig = updated.ui.motorRuntimeConfig;
        persisted.usingSavedSettings = true;
        settingsManager->save(persisted);
        persisted = settingsManager->load();
    }

    *settings = persisted;
    appState->setDevice(settings->device.deviceName, settings->device.friendlyName, true);
    deferredActions->pendingSettings = persisted;
    deferredActions->settingsApplyPending = true;
    return true;
}

bool saveMotorRuntimeConfigFromJson(JsonVariantConst root, String& error) {
    if (settings == nullptr || settingsManager == nullptr) {
        error = "Motor settings are unavailable.";
        return false;
    }

    String rawConfig;
    if (root.is<JsonObjectConst>() || root.is<JsonArrayConst>()) {
        serializeJson(root, rawConfig);
    } else {
        const char* rawValue = root.as<const char*>();
        if (rawValue != nullptr) {
            rawConfig = rawValue;
        }
    }

    rawConfig.trim();
    if (rawConfig.isEmpty() || rawConfig == "{}") {
        error = "Motor settings payload is invalid.";
        return false;
    }

    SettingsBundle updated = *settings;
    updated.ui.motorRuntimeConfig = rawConfig;
    preserveLearnedMotorStates(updated, *settings);
    updated.usingSavedSettings = true;

    settingsManager->save(updated);
    *settings = settingsManager->load();
    if (settings->ui.motorRuntimeConfig != updated.ui.motorRuntimeConfig) {
        settings->ui.motorRuntimeConfig = updated.ui.motorRuntimeConfig;
        settings->usingSavedSettings = true;
        settingsManager->save(*settings);
        *settings = settingsManager->load();
    }

    appState->setDevice(settings->device.deviceName, settings->device.friendlyName, true);
    applyRuntimeSettings();
    mqttManager->publishState();
    error = "";
    return true;
}

bool playRequest(const String& url, const String& label, const String& type, const String& source, String& error, bool addToHistory) {
    StorageTarget storageTarget = StorageTarget::Flash;
    String storagePath;
    const bool storageReference = parseStorageFileReference(url, storageTarget, storagePath);
    String normalizedUrl;
    if (!storageReference) {
        normalizedUrl = PlaybackText::normalizeUrl(url);
        if (normalizedUrl.isEmpty()) {
            error = "URL is required";
            return false;
        }
    }
#if APP_AUDIO_DIAGNOSTIC_TEST
    if (source != "diagnostic-test") {
        error = "Diagnostic audio test build only plays the configured MAX98357A test stream.";
        return false;
    }
#endif
#ifdef APP_DISABLE_AUDIO
    error = "Audio disabled in diagnostic build";
    return false;
#endif
    deferredActions->playFromStorage = storageReference;
    deferredActions->playStorageTarget = storageTarget;
    deferredActions->playStoragePath = storagePath;
    deferredActions->playUrl = storageReference ? String(url) : normalizedUrl;
    deferredActions->playLabel = storageReference
        ? PlaybackText::normalizeTitle(label, storagePath)
        : PlaybackText::normalizeTitle(label, normalizedUrl);
    deferredActions->playType = type;
    deferredActions->playAddToHistory = addToHistory;
    if (!source.isEmpty()) {
        deferredActions->playSource = source;
    } else {
        deferredActions->playSource = type == "tts" ? "home-assistant" : "manual";
    }
    deferredActions->playPending = true;
    deferredActions->stopPending = false;
    return true;
}

String playbackStartFailureMessage(const DeferredActions& actions) {
    if (actions.playLabel.length() > 0) {
        return String("Failed to start ") + actions.playLabel + ". Check that the selected audio file exists and is playable.";
    }
    if (actions.playFromStorage && actions.playStoragePath.length() > 0) {
        return String("Failed to start ") + actions.playStoragePath + ". Check that the selected audio file exists and is playable.";
    }
    if (actions.playUrl.length() > 0) {
        return String("Failed to start ") + actions.playUrl + ". Check that the selected audio file exists and is playable.";
    }
    return "Failed to start playback. Check that the selected audio file exists and is playable.";
}

void stopAlarmPlayback() {
    runtimeAudio.alarmActive = false;
    if (audioPlayer != nullptr && appState != nullptr) {
        const AppStateSnapshot snapshot = appState->snapshot();
        if (snapshot.playback.source == "effect-alarm") {
            audioPlayer->stop();
        }
    }
    scheduleAmbientResume();
}

