elik745i/ESP32-S3-Ceiling-Speaker/src/main.cpp
    wifiManager->begin(*settings, *appState);

    batteryMonitor->begin(settings->battery, settings->battery.adcPin, *appState);

    activeI2sBclkPin = settings->audio.bclkPin;
    activeI2sWsPin = settings->audio.wsPin;
    activeI2sDoutPin = settings->audio.doutPin;
    activeAudioOutputEnabled = settings->audio.enabled;
    audioPlayer->begin(activeI2sBclkPin, activeI2sWsPin, activeI2sDoutPin, settings->device.savedVolumePercent, activeAudioOutputEnabled, *appState);
#if APP_AUDIO_DIAGNOSTIC_TEST
    if (activeAudioOutputEnabled) {
        audioPlayer->setDirectLibraryVolume(DefaultConfig::AUDIO_DIAGNOSTIC_LIBRARY_VOLUME);
        Serial.printf("[audio-test] build enabled, waiting for Wi-Fi to start %s at library volume %u using BCLK=%u WS=%u DOUT=%u\n",
                      DefaultConfig::AUDIO_DIAGNOSTIC_STREAM_URL,
                      static_cast<unsigned>(DefaultConfig::AUDIO_DIAGNOSTIC_LIBRARY_VOLUME),
                      static_cast<unsigned>(activeI2sBclkPin),
                      static_cast<unsigned>(activeI2sWsPin),
                      static_cast<unsigned>(activeI2sDoutPin));
    }
#endif

    soundEffects->begin(*settings);
    otaManager->begin(*settings, *appState);
    otaManager->setRestartHandler(handleOtaRestartRequest);
    refreshRollbackStateInOtaManager();
    otaManager->setProgressCallback(pumpOtaDisplayProgress);

    mqttManager->begin(*settings, *appState, *wifiManager, *otaManager, handleMqttCommand, [](JsonObject root) {
        appendAugmentedMotorStatus(root);
    });
    motorController.begin([](int8_t limitInputIndex) {
        return limitInputIndex >= 0 ? readConfiguredLimitSwitchPressed(static_cast<size_t>(limitInputIndex)) : false;
    });

    webServer->begin(
        *appState,
        *wifiManager,
        *settingsManager,
        *otaManager,
        []() { return *settings; },
        saveSettingsFromJson,
        [](const String& url, const String& label, const String& type, String& error) {
            const bool effectSelection = type.startsWith("effect-");
            const bool addToHistory = !effectSelection;
            const String source = effectSelection ? type : String("");
            const String normalizedType = effectSelection ? String("effect") : type;
            if (effectSelection && appState != nullptr) {
                const AppStateSnapshot snapshot = appState->snapshot();
                queuePreviewResume(snapshot, source);
            } else {
                clearPreviewResumeState();
            }
            return playRequest(url, label, normalizedType, source, error, addToHistory);
        },
        []() {
            deferredActions->stopPending = true;
            deferredActions->playPending = false;
        },
        [](uint8_t volume) {
            deferredActions->pendingVolume = volume;
            deferredActions->volumePending = true;
        },
        [](bool apply) { return otaManager->triggerCheck(apply); },
        [](const String& action, String& error) {
            if (action == "rediscover") {
                return mqttManager->requestRediscovery(error);
            }

            const bool connect = action != "disconnect";
            if (connect) {
                const String host = deferredActions->settingsApplyPending
                    ? deferredActions->pendingSettings.mqtt.host
                    : settings->mqtt.host;
                if (host.isEmpty()) {
                    error = "Enter an MQTT host first.";
                    return false;
                }
            }
            deferredActions->mqttConnectRequested = connect;
            deferredActions->mqttConnectionChangePending = true;
            error = "";
            return true;
        },
        [](uint8_t channelIndex, bool forward, uint32_t durationMs, int8_t limitInputIndex, String& error) {
            if (!motorController.available()) {
                error = "DRV8833 control is not configured.";
                return false;
            }
            if (!motorController.runChannel(channelIndex, forward, durationMs, limitInputIndex, error)) {
                return false;
            }
            if (appState != nullptr) {
                appState->setLastError("");
            }
            if (mqttManager != nullptr) {
                mqttManager->publishState();
            }
            lastProcessedMotorStateVersion = motorController.stateVersion();
            lastPublishedMotorStateVersion = motorController.stateVersion();
            return true;
        },
        saveMotorRuntimeConfigFromJson,
        [](JsonObject root) {
            appendAugmentedMotorStatus(root);
        },
        []() { triggerWapeDisplay(); },
        []() {
            if (webServer != nullptr) {
                webServer->setWebUiLocked(true);
            }
            requestWebUiLockSequence();
        },
        []() { requestRestartSequence("manual", false); },
        []() { requestRestartSequence("factory_reset", true); });

    displayManager->setBootMessage("Idle");
#if !APP_AUDIO_DIAGNOSTIC_TEST
    runtimeAudio.startupEffectPending = !effectFileForSource("effect-startup").isEmpty();
    runtimeAudio.startupEffectAttempts = 0;
    runtimeAudio.startupEffectEligibleAt = millis() + kStartupEffectDelayMs;
#endif
    runtimeAudio.ambientEligibleAt = millis() + kAmbientResumeDelayMs;
    runtimeAudio.bootUpdateCheckQueued = settings->ota.autoCheck || settings->ota.autoUpdate;
    runtimeAudio.resumeSavedPlaybackPending = settings->audio.rememberLastPlayed && settings->audio.lastPlayback.resumeAfterBoot && !settings->audio.lastPlayback.url.isEmpty();
    if (settings->oled.displayType == "wape" && settings->oled.wapeTriggerEvent == "device_start") {
        requestWapeTriggerPulse();
    }

    applyRuntimeSettings();
}

namespace {
void flushPendingSettingsNow() {
    if (deferredActions == nullptr || !deferredActions->settingsApplyPending) {
        return;
    }
    settingsManager->save(deferredActions->pendingSettings);
    *settings = settingsManager->load();
    applyRuntimeSettings();
    deferredActions->settingsApplyPending = false;
    mqttManager->publishState();
}
}

void processSoundEffectTransitions(const AppStateSnapshot& snapshot) {
#if APP_AUDIO_DIAGNOSTIC_TEST
    (void)snapshot;
    return;
#endif
    if (soundEffects == nullptr || settings == nullptr) {
        return;
    }

    const bool nowPlaying = snapshot.playback.state == "playing" || snapshot.playback.state == "buffering";
    const bool wasPlaying = previousPlaybackState == "playing" || previousPlaybackState == "buffering";
    const bool playbackStopped = wasPlaying && !nowPlaying;
    const bool playbackStarted = !wasPlaying && nowPlaying;

    if (!transitionStateInitialized) {
        previousWifiConnected = snapshot.network.wifiConnected;
        previousMqttConnected = snapshot.network.mqttConnected;
        previousPlaybackState = snapshot.playback.state;
        previousPlaybackSource = snapshot.playback.source;
        previousPlaybackType = snapshot.playback.type;
        previousCharging = snapshot.battery.charging;
        transitionStateInitialized = true;
        return;
    }

    if (!previousWifiConnected && snapshot.network.wifiConnected) {
        soundEffects->playWifiConnected();
    } else if (previousWifiConnected && !snapshot.network.wifiConnected) {
        soundEffects->playWifiDisconnected();
    }

